# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D':[6,np.nan,np.nan]})
df

     A    B  C    D
0  1.0  5.0  1  6.0
1  2.0  NaN  2  NaN
2  NaN  NaN  3  NaN

In [7]:
# drops rows that countain NaN elements
df.dropna()

     A    B  C    D
0  1.0  5.0  1  6.0

In [8]:
# drops columns that countain NaN elements
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [9]:
# Keep only the rows with at least 2 non-na values
df.dropna(thresh=2)

     A    B  C    D
0  1.0  5.0  1  6.0
1  2.0  NaN  2  NaN

In [11]:
df.fillna(value='FILL VALUE')

            A           B  C           D
0           1           5  1           6
1           2  FILL VALUE  2  FILL VALUE
2  FILL VALUE  FILL VALUE  3  FILL VALUE

In [12]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Other Operations

In [35]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
df['col2'].unique()

array([444, 555, 666])

In [37]:
df['col2'].nunique()

3

In [38]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [39]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [40]:
def times2(x):
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [41]:
def add1_2(row):
    return row['col1'] + row['col2']

df['add1_2'] = df.apply(add1_2, axis=1)
df

   col1  col2 col3  add1_2
0     1   444  abc     445
1     2   555  def     557
2     3   666  ghi     669
3     4   444  xyz     448

In [42]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [43]:
df['col1'].sum()

10

** Permanently Removing a Column**

In [44]:
del df['col1']
df

   col2 col3  add1_2
0   444  abc     445
1   555  def     557
2   666  ghi     669
3   444  xyz     448

In [45]:
df.columns

Index([u'col2', u'col3', u'add1_2'], dtype='object')

In [46]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [47]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3  add1_2
0   444  abc     445
3   444  xyz     448
1   555  def     557
2   666  ghi     669

In [48]:
df.isnull()

    col2   col3 add1_2
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False